## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:65" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:65" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:fa1ec4f842e1a6da6d985e162346ee365d6bfa675d051c457e3863b62f05ec6b" -> "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:17f4a0be2afb0e2618b9878ea6c60a3684cb5751c07409f039baace50bb441f3"
-                   mountPoints            = []
                    name                   = "console"
-                   portMappings           = []
-                   systemControls         = []
-                   volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 65 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-cpfValidation must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-cpfValidation" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "70b6024f4dc0d7bbeadd02ffbbc9bfb6-5" -> "2032d24a1faa622f8d6365689cbbcf21"
      ~ id                     = "cpfValidation.4af7f6917e3f7f3f6015f54d9a5f80ea.zip" -> (known after apply)
      ~ key                    = "cpfValidation.4af7f6917e3f7f3f6015f54d9a5f80ea.zip" -> "cpfValidation.2032d24a1faa622f8d6365689cbbcf21.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "4af7f6917e3f7f3f6015f54d9a5f80ea" -> "2032d24a1faa622f8d6365689cbbcf21"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "v3tEaRee6hgr0fmvowTK_BsurmcFJxZ5" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-excelToJson must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-excelToJson" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "c6e555c8d1466e1908b33473faf4f97c-6" -> "c14f94724ff345d2473505225992af61"
      ~ id                     = "excelToJson.bf22415ea3d8067e15e40bada94c9285.zip" -> (known after apply)
      ~ key                    = "excelToJson.bf22415ea3d8067e15e40bada94c9285.zip" -> "excelToJson.c14f94724ff345d2473505225992af61.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "bf22415ea3d8067e15e40bada94c9285" -> "c14f94724ff345d2473505225992af61"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "SVnWbalObbDTGq5oV46ZuljFoYLBoq48" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-graphql must be replaced
+/- resource "aws_s3_object" "lambda_artifact-graphql" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "a4871b6fb274f8b6cb8b508887f89253-6" -> "640021f2c6b16b805db14cd0217749a4"
      ~ id                     = "graphql.0eb72859189cf50d5940e5f822a4ec37.zip" -> (known after apply)
      ~ key                    = "graphql.0eb72859189cf50d5940e5f822a4ec37.zip" -> "graphql.640021f2c6b16b805db14cd0217749a4.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "0eb72859189cf50d5940e5f822a4ec37" -> "640021f2c6b16b805db14cd0217749a4"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "ZkcX7FzrwZ6Re70dNVAuqlgKuph60oz9" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "990336778b51996c17d0a4a756342ad1" -> "b67979f6969eddc3678e4f2402c1858f"
        id                     = "dist/200.html"
      ~ source_hash            = "990336778b51996c17d0a4a756342ad1" -> "b67979f6969eddc3678e4f2402c1858f"
        tags                   = {}
      ~ version_id             = "JP7eZfWOFziihI_7Ik1kd2FnGjun8w6X" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "46014deb26d6ebfa4a82122f1c2704bf" -> "71895d356089997caa8ed1d4dd90ddff"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "46014deb26d6ebfa4a82122f1c2704bf" -> "71895d356089997caa8ed1d4dd90ddff"
        tags                   = {}
      ~ version_id             = "02nDkmuvPp7Ygu4SjfXJDcV2KXagjNGV" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "7f93d6d44562ccf170233aab0342965a" -> "96db4738ee89bb80d81a618652242b84"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "7f93d6d44562ccf170233aab0342965a" -> "96db4738ee89bb80d81a618652242b84"
        tags                   = {}
      ~ version_id             = "swapy_8j1wZLAnY8EgsqrwXd9KHVnEpv" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "990336778b51996c17d0a4a756342ad1" -> "b67979f6969eddc3678e4f2402c1858f"
        id                     = "dist/index.html"
      ~ source_hash            = "990336778b51996c17d0a4a756342ad1" -> "b67979f6969eddc3678e4f2402c1858f"
        tags                   = {}
      ~ version_id             = "Q4zQ68dWmWk3bdpSHYYPwdAMRvaH.0Ms" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadEditUploadPage.47627b0f.chunk.js"] will be destroyed
  # (because key ["static/js/UploadEditUploadPage.47627b0f.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "9387779d63c84b54aa3530d32023af39" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadEditUploadPage.47627b0f.chunk.js" -> null
-       key                    = "dist/static/js/UploadEditUploadPage.47627b0f.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadEditUploadPage.47627b0f.chunk.js" -> null
-       source_hash            = "9387779d63c84b54aa3530d32023af39" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "M2zgmSAeKOWhKbMXGMkXemFEO94DkgOk" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadEditUploadPage.47627b0f.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/UploadEditUploadPage.47627b0f.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "27a5f7584a3a992250b7df0de6d4c1a1" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadEditUploadPage.47627b0f.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/UploadEditUploadPage.47627b0f.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadEditUploadPage.47627b0f.chunk.js.LICENSE.txt" -> null
-       source_hash            = "27a5f7584a3a992250b7df0de6d4c1a1" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "SwzGg6ErplK9Gc70XC4cqJNE0a45XU3B" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadEditUploadPage.94eeee90.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "c81b9182241654d7b9a7105601ab414e"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadEditUploadPage.94eeee90.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadEditUploadPage.94eeee90.chunk.js"
+       source_hash            = "c81b9182241654d7b9a7105601ab414e"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadEditUploadPage.94eeee90.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "27a5f7584a3a992250b7df0de6d4c1a1"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadEditUploadPage.94eeee90.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadEditUploadPage.94eeee90.chunk.js.LICENSE.txt"
+       source_hash            = "27a5f7584a3a992250b7df0de6d4c1a1"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadNewUploadPage.bed97733.chunk.js"] will be destroyed
  # (because key ["static/js/UploadNewUploadPage.bed97733.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "2acf787af5dd8fd9f456df7292b6ef2d" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadNewUploadPage.bed97733.chunk.js" -> null
-       key                    = "dist/static/js/UploadNewUploadPage.bed97733.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadNewUploadPage.bed97733.chunk.js" -> null
-       source_hash            = "2acf787af5dd8fd9f456df7292b6ef2d" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "rxQtnCpSk74wUB6apKtutK_AQJeeuqva" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadNewUploadPage.bed97733.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/UploadNewUploadPage.bed97733.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "cc27fa172211f2877b50629ac7228a71" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadNewUploadPage.bed97733.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/UploadNewUploadPage.bed97733.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadNewUploadPage.bed97733.chunk.js.LICENSE.txt" -> null
-       source_hash            = "cc27fa172211f2877b50629ac7228a71" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "Jq9LWusPZpXSPN12IJAz6sgpbQD5G37h" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadNewUploadPage.e5915ccd.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "35a96bf2d02204ee9608f07ced33c891"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadNewUploadPage.e5915ccd.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadNewUploadPage.e5915ccd.chunk.js"
+       source_hash            = "35a96bf2d02204ee9608f07ced33c891"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadNewUploadPage.e5915ccd.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "cc27fa172211f2877b50629ac7228a71"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadNewUploadPage.e5915ccd.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadNewUploadPage.e5915ccd.chunk.js.LICENSE.txt"
+       source_hash            = "cc27fa172211f2877b50629ac7228a71"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.138ce762.js"] will be destroyed
  # (because key ["static/js/app.138ce762.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "e2ac62c836e3b4b7b508d44c91113f16" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.138ce762.js" -> null
-       key                    = "dist/static/js/app.138ce762.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.138ce762.js" -> null
-       source_hash            = "e2ac62c836e3b4b7b508d44c91113f16" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "E7T.fi16TNARFYzQkAXv6aDvJ1ZbdXCa" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.138ce762.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.138ce762.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "b703266ba347d460c07ac79899e011fa" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.138ce762.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.138ce762.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.138ce762.js.LICENSE.txt" -> null
-       source_hash            = "b703266ba347d460c07ac79899e011fa" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "jPrkGSRurHW9d0ZsfoPgXsgwHda..a_z" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.152d361b.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "f7e0415554331c2d3bb99ad3c2c25e4c"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.152d361b.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.152d361b.js"
+       source_hash            = "f7e0415554331c2d3bb99ad3c2c25e4c"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.152d361b.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "b703266ba347d460c07ac79899e011fa"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.152d361b.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.152d361b.js.LICENSE.txt"
+       source_hash            = "b703266ba347d460c07ac79899e011fa"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/runtime-app.5b45e415.js"] will be destroyed
  # (because key ["static/js/runtime-app.5b45e415.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "bd1302c7fdff6044366bf1d49146d5fa" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/runtime-app.5b45e415.js" -> null
-       key                    = "dist/static/js/runtime-app.5b45e415.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/runtime-app.5b45e415.js" -> null
-       source_hash            = "bd1302c7fdff6044366bf1d49146d5fa" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "nm3qwCBX3jjjGND3D3cSHGGmZQPJBgkl" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/runtime-app.b54e63ee.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "8e82565a4db5179b852c816d03086ce9"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/runtime-app.b54e63ee.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/runtime-app.b54e63ee.js"
+       source_hash            = "8e82565a4db5179b852c816d03086ce9"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ last_modified                  = "2024-03-29T16:27:48.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:34" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:34/invocations" -> (known after apply)
      ~ s3_key                         = "cpfValidation.4af7f6917e3f7f3f6015f54d9a5f80ea.zip" -> "cpfValidation.2032d24a1faa622f8d6365689cbbcf21.zip"
        tags                           = {}
      ~ version                        = "34" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "9a6c095c9edaca221312ea4a3e262ad9d10bedc9" -> "3944eee51685a747428a3b299f9c1d273ed6dec9"
              ~ "DD_TAGS"                      = "git.commit.sha:9a6c095c9edaca221312ea4a3e262ad9d10bedc9,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:3944eee51685a747428a3b299f9c1d273ed6dec9,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "9a6c095c9edaca221312ea4a3e262ad9d10bedc9" -> "3944eee51685a747428a3b299f9c1d273ed6dec9"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "34" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-excelToJson"
      ~ last_modified                  = "2024-03-29T16:27:47.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:34" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:34/invocations" -> (known after apply)
      ~ s3_key                         = "excelToJson.bf22415ea3d8067e15e40bada94c9285.zip" -> "excelToJson.c14f94724ff345d2473505225992af61.zip"
        tags                           = {}
      ~ version                        = "34" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "9a6c095c9edaca221312ea4a3e262ad9d10bedc9" -> "3944eee51685a747428a3b299f9c1d273ed6dec9"
              ~ "DD_TAGS"                      = "git.commit.sha:9a6c095c9edaca221312ea4a3e262ad9d10bedc9,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:3944eee51685a747428a3b299f9c1d273ed6dec9,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "9a6c095c9edaca221312ea4a3e262ad9d10bedc9" -> "3944eee51685a747428a3b299f9c1d273ed6dec9"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "34" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ last_modified                  = "2024-03-29T16:27:49.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:81" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:81/invocations" -> (known after apply)
      ~ s3_key                         = "graphql.0eb72859189cf50d5940e5f822a4ec37.zip" -> "graphql.640021f2c6b16b805db14cd0217749a4.zip"
        tags                           = {}
      ~ version                        = "81" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "9a6c095c9edaca221312ea4a3e262ad9d10bedc9" -> "3944eee51685a747428a3b299f9c1d273ed6dec9"
              ~ "DD_TAGS"                            = "git.commit.sha:9a6c095c9edaca221312ea4a3e262ad9d10bedc9,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:3944eee51685a747428a3b299f9c1d273ed6dec9,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "9a6c095c9edaca221312ea4a3e262ad9d10bedc9" -> "3944eee51685a747428a3b299f9c1d273ed6dec9"
                # (17 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "81" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 14 to add, 8 to change, 14 to destroy.
```

</details>

*Pusher: @laurelkorwin, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/8484222042)*